#+TITLE:     Altermesh, BuenosAiresLibre y CompartirEsBueno
#+AUTHOR:    Osiris Alejandro Gómez
#+EMAIL:     osiux@osiux.com
#+LANGUAGE:  es
#+LINK_HOME: index.html
#+INCLUDE: "header.org"
#+OPTIONS: toc:nil timestamp:nil
#+DATE:      2013-04-02

*** creando la llave =ssh=

    Se puede definir en una sóla línea el tipo =rsa=, el archivo dónde
    se almacenará =~/.ssh/llave_rsa= y una contraseña =cambiame=:

    #+BEGIN_SRC sh :session :results output :exports both
      ssh-keygen -t rsa -f ~/.ssh/llave_rsa -Pcambiame
    #+END_SRC

    #+RESULTS:
    #+begin_example
    Generating public/private rsa key pair.
    Your identification has been saved in /home/osiris/.ssh/llave_rsa.
    Your public key has been saved in /home/osiris/.ssh/llave_rsa.pub.
    The key fingerprint is:
    c6:cf:a5:4e:5d:9a:d8:cb:12:4b:9c:66:90:a5:90:67 osiris@inspiron
    The key's randomart image is:
    +--[ RSA 2048]----+
    |       .         |
    |      o E .      |
    |       + +       |
    |       .+        |
    |        So .. .  |
    |       . oB* +   |
    |         +*o=    |
    |         oo. .   |
    |          ..o    |
    +-----------------+
    #+end_example

    - OjO: Es posible crear una llave sin contraseña lo cual resulta
      más cómodo para ingresar al /Router/ pero más incómodo y seguro
      es usar una contraseña, sino cualquier que se copie nuestra
      llave (pública y privada) podrá acceder al /Router/ como si
      fuera =root=.

    Luego es necesario subir el contenido del archivo
    =~/.ssh/llave_rsa.pub= que es nuestra llave pública.
    
    La llave privada se encuentra en =~/.ssh/llave_rsa= NO se la debe
    copiar a nadie! Es conveniente hacer una copiar de seguridad.

*** descargar el firmware

    Una vez cocinado el firmware, hay que descargarlo:

    #+BEGIN_EXAMPLE
      cd ~/altermesh
      wget http://chef.mesh.altermundi.net/ls/CompartirEsBueno/r33815/altermesh-ar71xx-generic-tl-mr3220-v1-squashfs-r33815-CompartirEsBueno-nodo-compartir-factory.bin
    #+END_EXAMPLE

    Si se trata de la primera vez que se realiza la operación se debe
    elegir una imagen /factory/, en futuras actualizaciones se debe
    utilizar una imagen /sysupgrade/. Obviamente hay que elegir la
    imagen de acuerdo al modelo de /Router/ que vayamos a /flashear/.

    Es *altamente recomendado* verificar la integridad del mismo, el
    /hash/ debe coincidir con el que se encuentra en el archivo
    =md5sums=

    #+BEGIN_SRC sh :exports both
      cd ~/altermesh
      md5sum *.bin
    #+END_SRC

    #+RESULTS:
    : 24f6dfddbe4c1fbf29e74d3c32f24afc  altermesh-ar71xx-generic-tl-mr3220-v1-squashfs-r33815-CompartirEsBueno-nodo-compartir-factory.bin

*** conectándose por primera vez

    Si mantenemos el cable UTP conectado, ya deberíamos tener acceso
    al /Router/, ahora bien, como la idea no es que cualquiera lo
    administre, es necesario contar con una llave ssh, la misma fue
    agregada al cocinar el firmware, asi que bastaría acceder mediante
    ssh al equipo, sólo faltaría saber la dirección IP.

    /Altermesh/ cuenta con soporte IPv6 y nuestra notebook/compu
    también (aunque no lo sepamos) y magicamente cada interfaz de red
    cuenta con una dirección IPv6 autoasignada que consta de un
    prefijo + la macaddress de la placa de red.

    Es fácil comprobar nuestra dirección IPv6 mediante =ifconfig=:

    #+BEGIN_SRC sh :session :results output
      ifconfig wlan0 | grep inet6
    #+END_SRC

    #+RESULTS:
    :           Dirección inet6: 2a00:1508:1:f00f:6aa3:c4ff:fecf:b5b4/64 Alcance:Global
    :           Dirección inet6: fe80::6aa3:c4ff:fecf:b5b4/64 Alcance:Enlace
    :           Dirección inet6: 2a00:1508:1:f00f:d0ee:ad27:3551:2b6c/64 Alcance:Global

    Seguro contamos con al menos una IPv6 de alcance "Enlace" o Scope
    link-local en inglés. Esto quiere decir que podemos llegar a
    cualquier otro equipo con IPv6 por medio de esta interfaz y
    nuestra IPv6 es aquella que comienza con =fe80=, en mi caso:
    =fe80::6aa3:c4ff:fecf:b5b4=

*** descubrir routers

    Se puede realizar un =ping= a una dirección especial para obtener
    respuesta de todos los equipos en la red local que son /Routers/,
    normalmente hay un alias =ip6-allrouters= para =ff02:2=.

    Para las direcciones link-local es necesario indicar cuál es la
    interfaz de salida (no asi en las IPv6 de alcance global), esto se
    hace agregando el símbolo =%= y el nombre de la interfaz, por
    ejemplo =ff02::2%wlan0=:

    #+BEGIN_SRC sh :exports both :results output
      ping6 -c3 ff02::2%wlan0
    #+END_SRC

    #+RESULTS:
    : PING ff02::2%wlan0(ff02::2) 56 data bytes
    : 64 bytes from fe80::a2f3:c1ff:fe9d:2577: icmp_seq=1 ttl=255 time=1.22 ms
    : 64 bytes from fe80::68d3:ecff:fefb:d060: icmp_seq=1 ttl=255 time=10.4 ms (DUP!)
    : 64 bytes from fe80::a2f3:c1ff:fe9d:2577: icmp_seq=2 ttl=255 time=1.48 ms
    : 64 bytes from fe80::68d3:ecff:fefb:d060: icmp_seq=2 ttl=255 time=8.02 ms (DUP!)
    : 
    : --- ff02::2%wlan0 ping statistics ---
    : 3 packets transmitted, 2 received, +2 duplicates, 33% packet loss, time 2002ms
    : rtt min/avg/max/mdev = 1.229/5.305/10.485/4.043 ms

*** descubrir nodos

    Aquellos equipos que no sean /Routers/ pero si forman parte de la
    red IPv6 son considerados nodos y responden al alias
    =ip6-allnodes= o la dirección =ff02::1=.

    #+BEGIN_SRC sh :exports both :results output
      ping6 -c3 ff02::1%wlan0
    #+END_SRC

    #+RESULTS:
    #+begin_example
    PING ff02::1%wlan0(ff02::1) 56 data bytes
    64 bytes from fe80::6aa3:c4ff:fecf:b5b4: icmp_seq=1 ttl=64 time=0.085 ms
    64 bytes from fe80::68d3:ecff:fefb:d060: icmp_seq=1 ttl=64 time=156 ms (DUP!)
    64 bytes from fe80::1e4b:d6ff:fed2:f99: icmp_seq=1 ttl=64 time=316 ms (DUP!)
    64 bytes from fe80::6aa3:c4ff:fecf:b5b4: icmp_seq=2 ttl=64 time=0.086 ms
    64 bytes from fe80::68d3:ecff:fefb:d060: icmp_seq=2 ttl=64 time=9.74 ms (DUP!)
    64 bytes from fe80::a2f3:c1ff:fe9d:2577: icmp_seq=1 ttl=64 time=1124 ms (DUP!)
    64 bytes from fe80::a2f3:c1ff:fe9d:2577: icmp_seq=2 ttl=64 time=123 ms (DUP!)
    64 bytes from fe80::6aa3:c4ff:fecf:b5b4: icmp_seq=3 ttl=64 time=0.088 ms

    --- ff02::1%wlan0 ping statistics ---
    3 packets transmitted, 3 received, +5 duplicates, 0% packet loss, time 2002ms
    rtt min/avg/max/mdev = 0.085/216.376/1124.681/358.855 ms, pipe 2
    #+end_example

*** accediendo por ssh

    Al acceder al /Router/ se solicita la contraseña de la llave ssh
    (si fue establecida) y se visualiza la revisión del firmware, en
    mi caso =r33815= y es un dato a tener en cuenta, a veces algunas
    funcionalidades están presentes sólo en algunas versiones o en
    ocasiones no funcionan del todo bien en alguna revisión en
    particular o incluso en algún modelo de /Router/.
  
    #+BEGIN_EXAMPLE
      ▶ ssh root@fe80::a2f3:c1ff:fe9d:2577%wlan0
      Enter passphrase for key '/home/osiris/.ssh/id_rsa': 

      BusyBox v1.19.4 (2013-01-14 16:57:22 ART) built-in shell (ash)
      Enter 'help' for a list of built-in commands.

        _______                     ________        __
       |       |.-----.-----.-----.|  |  |  |.----.|  |_
       |   -   ||  _  |  -__|     ||  |  |  ||   _||   _|
       |_______||   __|_____|__|__||________||__|  |____|
                |__| W I R E L E S S   F R E E D O M
       BARRIER BREAKER (Bleeding Edge, r33815)
       (AlterMesh, maintained by: gui _@_ altermundi.net)
       (Get your own at: http://chef.mesh.altermundi.net)

      root@aleosi:~# 
    #+END_EXAMPLE

   Una vez logueados como =root= es posible reconfigurar el equipo,
   conectarse a otras redes e incluso romper todo, asi que a leer un
   poco antes de tipear y darle enter.

   También es posible tirar comandos sin loguearse, por ejemplo si
   quisieramos saber cuánto espacio hay disponible:

   #+BEGIN_SRC sh :session :results output :exports both
     ssh root@fe80::a2f3:c1ff:fe9d:2577%wlan0 'df -h'
   #+END_SRC

   #+RESULTS:
   : Filesystem                Size      Used Available Use% Mounted on
   : rootfs                    4.5M    660.0K      3.9M  14% /
   : /dev/root                 2.5M      2.5M         0 100% /rom
   : tmpfs                    14.3M      1.7M     12.7M  12% /tmp
   : tmpfs                   512.0K         0    512.0K   0% /dev
   : /dev/mtdblock3            4.5M    660.0K      3.9M  14% /overlay
   : overlayfs:/overlay        4.5M    660.0K      3.9M  14% /

